LiteOS/LiteOS/targets/Standard_CC3220x_LAUNCHXL/Drivers/ti/drivers/spi/SPICC32XXDMA.c
    /* Enable DMA to generate interrupt on SPI peripheral */
    MAP_SPIDmaEnable(hwAttrs->baseAddr, SPI_RX_DMA | SPI_TX_DMA);
    MAP_SPIIntClear(hwAttrs->baseAddr, SPI_INT_DMARX);
    MAP_SPIIntEnable(hwAttrs->baseAddr, SPI_INT_DMARX);
    MAP_SPIWordCountSet(hwAttrs->baseAddr, object->currentXferAmt);

    /* Enable channels & start DMA transfers */
    MAP_uDMAChannelEnable(hwAttrs->txChannelIndex);
    MAP_uDMAChannelEnable(hwAttrs->rxChannelIndex);

    HwiP_restore(key);

    MAP_SPIEnable(hwAttrs->baseAddr);
    MAP_SPICSEnable(hwAttrs->baseAddr);
}

/*
 *  ======== getDmaRemainingXfers ========
 */
static inline uint32_t getDmaRemainingXfers(SPICC32XXDMA_HWAttrsV1 const *hwAttrs) {
    uint32_t          controlWord;
    tDMAControlTable *controlTable;

    controlTable = MAP_uDMAControlBaseGet();
    controlWord = controlTable[(hwAttrs->rxChannelIndex & 0x3f)].ulControl;

    return (((controlWord & UDMA_CHCTL_XFERSIZE_M) >> 4) + 1);
}

/*
 *  ======== getPowerMgrId ========
 */
static uint16_t getPowerMgrId(uint32_t baseAddr)
{
    switch (baseAddr) {
        case GSPI_BASE:
            return (PowerCC32XX_PERIPH_GSPI);
        case LSPI_BASE:
            return (PowerCC32XX_PERIPH_LSPI);
        default:
            return (~0);
    }
}

/*
 *  ======== initHw ========
 */
static void initHw(SPICC32XXDMA_Object *object,
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs)
{
    /*
     * SPI peripheral should remain disabled until a transfer is requested.
     * This is done to prevent the RX FIFO from gathering data from other
     * transfers.
     */
    MAP_SPICSDisable(hwAttrs->baseAddr);
    MAP_SPIDisable(hwAttrs->baseAddr);
    MAP_SPIReset(hwAttrs->baseAddr);

    MAP_SPIConfigSetExpClk(hwAttrs->baseAddr,
        MAP_PRCMPeripheralClockGet(hwAttrs->spiPRCM), object->bitRate,
        mode[object->spiMode], object->frameFormat,
        (hwAttrs->csControl | hwAttrs->pinMode | hwAttrs->turboMode |
        hwAttrs->csPolarity | ((object->dataSize - 1) << 7)));

    MAP_SPIFIFOEnable(hwAttrs->baseAddr, SPI_RX_FIFO | SPI_TX_FIFO);
    MAP_SPIFIFOLevelSet(hwAttrs->baseAddr, object->txFifoTrigger,
        object->rxFifoTrigger);
}

/*
 *  ======== postNotifyFxn ========
 */
static int postNotifyFxn(unsigned int eventType, uintptr_t eventArg,
    uintptr_t clientArg)
{
    SPICC32XXDMA_Object          *object = ((SPI_Handle) clientArg)->object;
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs = ((SPI_Handle) clientArg)->hwAttrs;

    initHw(object, hwAttrs);

    return (Power_NOTIFYDONE);
}

/*
 *  ======== spiHwiFxn ========
 */
static void spiHwiFxn(uintptr_t arg)
{
    uint32_t                      intFlags;
    SPI_Transaction              *msg;
    SPICC32XXDMA_Object          *object = ((SPI_Handle)arg)->object;
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs = ((SPI_Handle)arg)->hwAttrs;

    /*
     * Although the DMATX interrupt is not used by this driver, it seems like
     * it is still triggering DMA interrupts.  The code below will clear &
     * disable the interrupt thus reducing the amount of spurious interrupts.
     */
    intFlags = MAP_SPIIntStatus(hwAttrs->baseAddr, false);
    if (intFlags & SPI_INT_DMATX) {
        MAP_SPIIntDisable(hwAttrs->baseAddr, SPI_INT_DMATX);
        MAP_SPIIntClear(hwAttrs->baseAddr, SPI_INT_DMATX);
    }

    if (MAP_uDMAChannelIsEnabled(hwAttrs->rxChannelIndex)) {
        /* DMA has not completed if the channel is still enabled */
        return;
    }

    /* RX DMA channel has completed; disable peripheral */
    MAP_SPIDmaDisable(hwAttrs->baseAddr, SPI_RX_DMA | SPI_TX_DMA);
    MAP_SPIIntDisable(hwAttrs->baseAddr, SPI_INT_DMARX);
    MAP_SPIIntClear(hwAttrs->baseAddr, SPI_INT_DMARX);
    MAP_SPICSDisable(hwAttrs->baseAddr);
    MAP_SPIDisable(hwAttrs->baseAddr);

    if (object->transaction->count - object->amtDataXferred >
        MAX_DMA_TRANSFER_AMOUNT) {
        /* Data still remaining, configure another DMA transfer */
        object->amtDataXferred += object->currentXferAmt;

        configDMA(object, hwAttrs, object->transaction);
    }
    else {
        /* All data sent; set status, perform callback & return */
        object->transaction->status = SPI_TRANSFER_COMPLETED;

        /* Release constraint since transaction is done */
        Power_releaseConstraint(PowerCC32XX_DISALLOW_LPDS);

        /*
         * Use a temporary transaction pointer in case the callback function
         * attempts to perform another SPI_transfer call
         */
        msg = object->transaction;

        /* Indicate we are done with this transfer */
        object->transaction = NULL;

        object->transferCallbackFxn((SPI_Handle) arg, msg);
    }
}

/*
 *  ======== spiPollingTransfer ========
 */
static inline void spiPollingTransfer(SPICC32XXDMA_Object *object,
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs, SPI_Transaction *transaction)
{
    uint8_t   increment;
    uint32_t  dummyBuffer;
    size_t    transferCount;
    void     *rxBuf;
    void     *txBuf;

    if (transaction->rxBuf) {
        rxBuf = transaction->rxBuf;
    }
    else {
        rxBuf = hwAttrs->scratchBufPtr;
    }

    if (transaction->txBuf) {
        txBuf = transaction->txBuf;
    }
    else {
        *hwAttrs->scratchBufPtr = hwAttrs->defaultTxBufValue;
        txBuf = hwAttrs->scratchBufPtr;
    }

    if (object->dataSize < 9) {
        increment = sizeof(uint8_t);
    }
    else if (object->dataSize < 17) {
        increment = sizeof(uint16_t);
    }
    else {
        increment = sizeof(uint32_t);
    }

    transferCount = transaction->count;

    /*
     * Start the polling transfer - we MUST set word count to 0; not doing so
     * will raise spurious RX interrupts flags (though interrupts are not
     * enabled).
     */
    MAP_SPIWordCountSet(hwAttrs->baseAddr, 0);
    MAP_SPIEnable(hwAttrs->baseAddr);
    MAP_SPICSEnable(hwAttrs->baseAddr);

    while (transferCount--) {
        if (object->dataSize < 9) {
            MAP_SPIDataPut(hwAttrs->baseAddr, *((uint8_t *) txBuf));
            MAP_SPIDataGet(hwAttrs->baseAddr, (unsigned long *)&dummyBuffer);
            *((uint8_t *) rxBuf) = (uint8_t) dummyBuffer;
        }
        else if (object->dataSize < 17) {
            MAP_SPIDataPut(hwAttrs->baseAddr, *((uint16_t *) txBuf));
            MAP_SPIDataGet(hwAttrs->baseAddr, (unsigned long *) &dummyBuffer);
            *((uint16_t *) rxBuf) = (uint16_t) dummyBuffer;
        }
        else {
            MAP_SPIDataPut(hwAttrs->baseAddr, *((uint32_t *) txBuf));
            MAP_SPIDataGet(hwAttrs->baseAddr, (unsigned long * ) rxBuf);
        }

