LiteOS/LiteOS/targets/Standard_CC3220x_LAUNCHXL/Drivers/ti/drivers/spi/SPICC32XXDMA.c
        /* Only increment source & destination if buffers were provided */
        if (transaction->rxBuf) {
            rxBuf = (void *) (((uint32_t) rxBuf) + increment);
        }
        if (transaction->txBuf) {
            txBuf = (void *) (((uint32_t) txBuf) + increment);
        }
    }

    MAP_SPICSDisable(hwAttrs->baseAddr);
    MAP_SPIDisable(hwAttrs->baseAddr);
}

/*
 *  ======== SPICC32XXDMA_close ========
 */
void SPICC32XXDMA_close(SPI_Handle handle)
{
    uint32_t                      padRegister;
    SPICC32XXDMA_Object          *object = handle->object;
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    MAP_SPICSDisable(hwAttrs->baseAddr);
    MAP_SPIDisable(hwAttrs->baseAddr);
    MAP_SPIFIFODisable(hwAttrs->baseAddr, SPI_RX_FIFO | SPI_TX_FIFO);

    /* Release power dependency on SPI. */
    Power_releaseDependency(getPowerMgrId(hwAttrs->baseAddr));
    Power_unregisterNotify(&(object->notifyObj));

    if (object->hwiHandle) {
        HwiP_delete(object->hwiHandle);
    }
    if (object->transferComplete) {
        SemaphoreP_delete(object->transferComplete);
    }

    if (object->dmaHandle) {
        UDMACC32XX_close(object->dmaHandle);
    }

    /* Restore pin pads to their reset states */
    if (hwAttrs->mosiPin != SPICC32XXDMA_PIN_NO_CONFIG) {
        padRegister = (PinToPadGet((hwAttrs->mosiPin) & 0xff)<<2)
            + PAD_CONFIG_BASE;
        HWREG(padRegister) = PAD_RESET_STATE;
    }
    if (hwAttrs->misoPin != SPICC32XXDMA_PIN_NO_CONFIG) {
        padRegister = (PinToPadGet((hwAttrs->misoPin) & 0xff)<<2)
            + PAD_CONFIG_BASE;
        HWREG(padRegister) = PAD_RESET_STATE;
    }
    if (hwAttrs->clkPin != SPICC32XXDMA_PIN_NO_CONFIG) {
        padRegister = (PinToPadGet((hwAttrs->clkPin) & 0xff)<<2)
            + PAD_CONFIG_BASE;
        HWREG(padRegister) = PAD_RESET_STATE;
    }
    if ((hwAttrs->pinMode == SPI_4PIN_MODE) &&
        (hwAttrs->csPin != SPICC32XXDMA_PIN_NO_CONFIG)) {
        padRegister = (PinToPadGet((hwAttrs->csPin) & 0xff)<<2)
            + PAD_CONFIG_BASE;
        HWREG(padRegister) = PAD_RESET_STATE;
    }

    object->isOpen = false;
}

/*
 *  ======== SPICC32XXDMA_control ========
 */
int_fast16_t SPICC32XXDMA_control(SPI_Handle handle, uint_fast16_t cmd, void *arg)
{
    return (SPI_STATUS_UNDEFINEDCMD);
}

/*
 *  ======== SPICC32XXDMA_init ========
 */
void SPICC32XXDMA_init(SPI_Handle handle)
{
    UDMACC32XX_init();
}

/*
 *  ======== SPICC32XXDMA_open ========
 */
SPI_Handle SPICC32XXDMA_open(SPI_Handle handle, SPI_Params *params)
{
    uintptr_t                     key;
    uint16_t                      pin;
    uint16_t                      mode;
    uint8_t                       powerMgrId;
    HwiP_Params                   hwiParams;
    SPICC32XXDMA_Object          *object = handle->object;
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    key = HwiP_disable();

    if (object->isOpen) {
        HwiP_restore(key);

        return (NULL);
    }
    object->isOpen = true;

    HwiP_restore(key);

    /* SPI_TI & SPI_MW are not supported */
    if (params->frameFormat == SPI_TI || params->frameFormat == SPI_MW) {
        object->isOpen = false;

        return (NULL);
    }

    /* Register power dependency - i.e. power up and enable clock for SPI. */
    powerMgrId = getPowerMgrId(hwAttrs->baseAddr);
    if (powerMgrId > PowerCC32XX_NUMRESOURCES) {
        object->isOpen = false;

        return (NULL);
    }
    Power_setDependency(powerMgrId);
    Power_registerNotify(&(object->notifyObj), PowerCC32XX_AWAKE_LPDS,
        postNotifyFxn, (uintptr_t) handle);

    /* Configure the pins */
    if (hwAttrs->mosiPin != SPICC32XXDMA_PIN_NO_CONFIG) {
        pin = (hwAttrs->mosiPin) & 0xff;
        mode = (hwAttrs->mosiPin >> 8) & 0xff;
        MAP_PinTypeSPI((unsigned long) pin, (unsigned long) mode);
    }

    if (hwAttrs->misoPin != SPICC32XXDMA_PIN_NO_CONFIG) {
        pin = (hwAttrs->misoPin) & 0xff;
        mode = (hwAttrs->misoPin >> 8) & 0xff;
        MAP_PinTypeSPI((unsigned long) pin, (unsigned long) mode);
    }

    if (hwAttrs->clkPin != SPICC32XXDMA_PIN_NO_CONFIG) {
        pin = (hwAttrs->clkPin) & 0xff;
        mode = (hwAttrs->clkPin >> 8) & 0xff;
        MAP_PinTypeSPI((unsigned long) pin, (unsigned long) mode);
    }

    if (hwAttrs->pinMode == SPI_4PIN_MODE) {
        if (hwAttrs->csPin != SPICC32XXDMA_PIN_NO_CONFIG) {
            pin = (hwAttrs->csPin) & 0xff;
            mode = (hwAttrs->csPin >> 8) & 0xff;
            MAP_PinTypeSPI((unsigned long) pin, (unsigned long) mode);
        }
    }

    object->dmaHandle = UDMACC32XX_open();
    if (object->dmaHandle == NULL) {
        SPICC32XXDMA_close(handle);

        return (NULL);
    }

    HwiP_Params_init(&hwiParams);
    hwiParams.arg = (uintptr_t) handle;
    hwiParams.priority = hwAttrs->intPriority;
    object->hwiHandle = HwiP_create(hwAttrs->intNum, spiHwiFxn, &hwiParams);
    if (object->hwiHandle == NULL) {
        SPICC32XXDMA_close(handle);

        return (NULL);
    }

    if (params->transferMode == SPI_MODE_BLOCKING) {
        /*
         * Create a semaphore to block task execution for the duration of the
         * SPI transfer
         */
        object->transferComplete = SemaphoreP_createBinary(0);
        if (object->transferComplete == NULL) {
            SPICC32XXDMA_close(handle);

            return (NULL);
        }

        object->transferCallbackFxn = blockingTransferCallback;
    }
    else {
        if (params->transferCallbackFxn == NULL) {
            SPICC32XXDMA_close(handle);

            return (NULL);
        }

        object->transferCallbackFxn = params->transferCallbackFxn;
    }

    object->bitRate = params->bitRate;
    object->dataSize = params->dataSize;
    object->frameFormat = params->frameFormat;
    object->spiMode = params->mode;
    object->transaction = NULL;
    object->transferMode = params->transferMode;
    object->transferTimeout = params->transferTimeout;

