LiteOS/LiteOS/targets/Standard_CC3220x_LAUNCHXL/Drivers/ti/drivers/spi/SPICC32XXDMA.c
    /* SPI FIFO trigger sizes vary based on data frame size */
    if (object->dataSize < 9) {
        object->rxFifoTrigger = sizeof(uint8_t);
        object->txFifoTrigger = sizeof(uint8_t);
    }
    else if (object->dataSize < 17) {
        object->rxFifoTrigger = sizeof(uint16_t);
        object->txFifoTrigger = sizeof(uint16_t);
    }
    else {
        object->rxFifoTrigger = sizeof(uint32_t);
        object->txFifoTrigger = sizeof(uint32_t);
    }

    initHw(object, hwAttrs);

    return (handle);
}

/*
 *  ======== SPICC32XXDMA_transfer ========
 */
bool SPICC32XXDMA_transfer(SPI_Handle handle, SPI_Transaction *transaction)
{
    uintptr_t                     key;
    uint8_t                       alignMask;
    bool                          buffersAligned;
    SPICC32XXDMA_Object          *object = handle->object;
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    if ((transaction->count == 0) ||
        (transaction->rxBuf == NULL && transaction->txBuf == NULL) ||
        (hwAttrs->scratchBufPtr == NULL && (transaction->rxBuf == NULL ||
            transaction->txBuf == NULL))) {
        return (false);
    }

    key = HwiP_disable();

    /*
     * alignMask is used to determine if the RX/TX buffers addresses are
     * aligned to the data frame size.
     */
    alignMask = (object->rxFifoTrigger - 1);
    buffersAligned = ((((uint32_t) transaction->rxBuf & alignMask) == 0) &&
        (((uint32_t) transaction->txBuf & alignMask) == 0));

    if (object->transaction) {
        HwiP_restore(key);

        return (false);
    }
    else {
        object->transaction = transaction;
        object->transaction->status = SPI_TRANSFER_STARTED;
        object->amtDataXferred = 0;
        object->currentXferAmt = 0;
    }

    HwiP_restore(key);

    /* Set constraints to guarantee transaction */
    Power_setConstraint(PowerCC32XX_DISALLOW_LPDS);

    /* Polling transfer if BLOCKING mode & transaction->count < threshold */
    if ((object->transferMode == SPI_MODE_BLOCKING &&
        transaction->count < hwAttrs->minDmaTransferSize) || !buffersAligned) {
        spiPollingTransfer(object, hwAttrs, transaction);

        /* Transaction completed; set status & mark SPI ready */
        object->transaction->status = SPI_TRANSFER_COMPLETED;
        object->transaction = NULL;

        Power_releaseConstraint(PowerCC32XX_DISALLOW_LPDS);
    }
    else {
        /* Perform a DMA backed SPI transfer */
        configDMA(object, hwAttrs, transaction);

        if (object->transferMode == SPI_MODE_BLOCKING) {
            if (SemaphoreP_pend(object->transferComplete,
                object->transferTimeout) != SemaphoreP_OK) {
                /* Timeout occurred; cancel the transfer */
                object->transaction->status = SPI_TRANSFER_FAILED;
                SPICC32XXDMA_transferCancel(handle);

                /*
                 * TransferCancel() performs callback which posts
                 * transferComplete semaphore. This call consumes this extra post.
                 */
                SemaphoreP_pend(object->transferComplete, SemaphoreP_NO_WAIT);

                return (false);
            }
        }
    }

    return (true);
}

/*
 *  ======== SPICC32XXDMA_transferCancel ========
 */
void SPICC32XXDMA_transferCancel(SPI_Handle handle)
{
    uintptr_t                     key;
    SPI_Transaction              *msg;
    SPICC32XXDMA_Object          *object = handle->object;
    SPICC32XXDMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    /*
     * There are 2 use cases in which to call transferCancel():
     *   1.  The driver is in CALLBACK mode.
     *   2.  The driver is in BLOCKING mode & there has been a transfer timeout.
     */
    if (object->transferMode == SPI_MODE_CALLBACK ||
        object->transaction->status == SPI_TRANSFER_FAILED) {

        key = HwiP_disable();

        if (object->transaction == NULL || object->cancelInProgress) {
            HwiP_restore(key);

            return;
        }
        object->cancelInProgress = true;

        /* Prevent interrupt from occurring while canceling the transfer */
        HwiP_disableInterrupt(hwAttrs->intNum);
        HwiP_clearInterrupt(hwAttrs->intNum);

        /* Clear DMA configuration */
        MAP_uDMAChannelDisable(hwAttrs->rxChannelIndex);
        MAP_uDMAChannelDisable(hwAttrs->txChannelIndex);

        MAP_SPIIntDisable(hwAttrs->baseAddr, SPI_INT_DMARX);
        MAP_SPIIntClear(hwAttrs->baseAddr, SPI_INT_DMARX);
        MAP_SPIDmaDisable(hwAttrs->baseAddr, SPI_RX_DMA | SPI_TX_DMA);

        HwiP_restore(key);

        /*
         * Disables peripheral, clears all registers & reinitializes it to
         * parameters used in SPI_open()
         */
        initHw(object, hwAttrs);

        HwiP_enableInterrupt(hwAttrs->intNum);

        /*
         * Calculate amount of data which has already been sent & store
         * it in transaction->count
         */
        object->transaction->count = object->amtDataXferred +
            (object->currentXferAmt - getDmaRemainingXfers(hwAttrs));

        /* Set status CANCELED if we did not cancel due to timeout  */
        if (object->transaction->status == SPI_TRANSFER_STARTED) {
            object->transaction->status = SPI_TRANSFER_CANCELED;
        }

        /* Release constraint set during transaction */
        Power_releaseConstraint(PowerCC32XX_DISALLOW_LPDS);

        /*
         * Use a temporary transaction pointer in case the callback function
         * attempts to perform another SPI_transfer call
         */
        msg = object->transaction;

        /* Indicate we are done with this transfer */
        object->transaction = NULL;
        object->cancelInProgress = false;
        object->transferCallbackFxn(handle, msg);
    }
}
